# -*- coding: utf-8 -*-
from e1 import E, add
add("別出心裁","ㄅㄧㄝˊ ㄔㄨ ㄒㄧㄣ ㄘㄞˊ","比喻獨創一格，與眾不同。","這件別出心裁的設計，為我們贏得國際設計大獎。","別具匠心　不落窠臼","如法炮製　陳陳相因",[("猜謎","慈母手中線，遊子身上衣——別出心裁")])
add("泰山鴻毛","ㄊㄞˋ ㄕㄢ ㄏㄨㄥˊ ㄇㄠˊ","比喻輕重相差懸殊。","一名惡徒的死和警察的為國捐軀，正是泰山鴻毛的差別。")
add("侃侃而談","ㄎㄢˇ ㄎㄢˇ ㄦˊ ㄊㄢˊ","形容人從容不迫的談論。","在學術研討會上，教授侃侃而談，暢談研究的成果。","口若懸河　滔滔不絕","木訥少言　噤若寒蟬")
add("良莠不齊","ㄌㄧㄤˊ ㄧㄡˇ ㄅㄨˋ ㄑㄧˊ","指好壞相混，參差不齊。","電視節目良莠不齊，家長應為孩子多加留意，慎選比較。","龍蛇混雜　良莠雜陳","涇渭分明")
add("楚材晉用","ㄔㄨˇ ㄘㄞˊ ㄐㄧㄣˋ ㄩㄥˋ","比喻自己的人才被他人所用。","留學生學成後不願回國服務，這種楚材晉用的情形十分嚴重。")
add("一意孤行","ㄧˋ ㄧˋ ㄍㄨ ㄒㄧㄥˊ","形容人固執己見，獨斷獨行。","海面上低氣壓籠罩，他依然不顧眾人勸阻，一意孤行，執意出海。","我行我素　固執己見","言聽計從　從善如流",[("典故","漢朝的趙禹為官廉潔，性情孤傲，執法嚴苛。從他做官以來，家中沒有食客。其他官員登門拜訪，他也不會回拜答謝，目的在杜絕朋友賓客的請託，能按照自己的意見獨立處理公事。本含有褒義，後轉用來形容人固執己見，獨斷獨行。")])
add("盲人摸象","ㄇㄤˊ ㄖㄣˊ ㄇㄛ ㄒㄧㄤˋ","比喻人所獲得的見識非常偏狹，未能明瞭全體。","他對這件事片面的見解如同盲人摸象。","管中窺豹　扣槃捫燭","真知灼見　洞若觀火",[("歇後語","盲人摸象——不識大體")])
add("眉飛色舞","ㄇㄟˊ ㄈㄟ ㄙㄜˋ ㄨˇ","形容人喜悅得意的神態。","他聽到父親即將歸國的消息後，高興得眉飛色舞。","眉開眼笑　喜上眉梢","垂頭喪氣　愁眉不展")
add("張皇失措","ㄓㄤ ㄏㄨㄤˊ ㄕ ㄘㄨㄛˋ","形容人驚慌、不知所措的樣子。","一聽到老師來了，搗亂的同學張皇失措，不知如何是好。","手足無措　形色倉皇","有恃無恐　處之泰然",[("辨析","「張皇失措」是指人驚慌、不知所措，而「心神不定」、「坐立不安」則指心情急躁不安。")])
add("眾志成城","ㄓㄨㄥˋ ㄓˋ ㄔㄥˊ ㄔㄥˊ","比喻眾人一心，可以產生極大的力量，成就任何事情。","只要全國人民團結一致，眾志成城，開創新紀元。","眾擎易舉　萬眾一心","孤掌難鳴　獨木難支")
add("庸人自擾","ㄩㄥ ㄖㄣˊ ㄗˋ ㄖㄠˇ","庸人，見識淺陋的人。用以指對事情理解不明，無故自滋紛擾。","你別整天胡思亂想，庸人自擾。","杞人憂天","無憂無慮",[("典故","唐朝的時候，有位心胸寬大的刺史叫陸象先，百姓們都十分尊敬他。某一次，有個普通人犯了小罪，陸象先只是責備那人幾句就打算放了他。陸象先的屬下看不過去，建議陸象先判他杖刑，以建立起當官的威嚴。可是，陸象先卻說：「人情都是差不多的，我相信他一定了解我說的話，知道要改過。天下本無事，只是庸人自擾之，所以事情才會越來越複雜。只要在開始時態度冷靜，一切事情便簡單多了。」")])
