# -*- coding: utf-8 -*-
from e2 import E, add
add("歷歷在目","ㄌㄧˋ ㄌㄧˋ ㄗㄞˋ ㄇㄨˋ","指遠方的景物看得很清楚。也指過去的情景十分明顯地浮現在眼前。","和外婆相處的往事仍歷歷在目，而今卻已人事全非。","昭昭在目　歷歷如繪","影影綽綽　霧裡看花",[("辨析","「歷歷可數」是指事物清清楚楚，可以數得出來，「歷歷在目」是指過去的情景十分明顯地浮現在眼前。兩者意思完全不同。"),("猜謎","碗裡的豆子——歷歷在目")])
add("欲蓋彌彰","ㄩˋ ㄍㄞˋ ㄇㄧˊ ㄓㄤ","蓋，掩飾。彌，更加。彰，明顯。指本來想加以掩蓋，結果反而暴露得更明顯。","這位藝人逢人就拚命解釋緋聞，實在是欲蓋彌彰。")
add("銷聲匿跡","ㄒㄧㄠ ㄕㄥ ㄋㄧˋ ㄐㄧ","隱藏形跡，不公開出現。","嫁作人婦後，她從此在螢光幕前銷聲匿跡，專心在家相夫教子。","無影無蹤")
add("淺斟低唱","ㄑㄧㄢˇ ㄓㄣ ㄉㄧ ㄔㄤˋ","形容人沉醉於飲酒歌唱的悠閒樂趣當中。","閒來無事，獨自淺斟低唱，倒也其樂無窮。")
add("無病呻吟","ㄨˊ ㄅㄧㄥˋ ㄕㄣ ㄧㄣˊ","比喻沒有真實情感，而故作感慨的樣子。","寫作文章必須有真實感情，切忌無病呻吟。","裝腔作勢","若無其事")
add("游手好閒","ㄧㄡˊ ㄕㄡˇ ㄏㄠˋ ㄒㄧㄢˊ","形容人遊蕩閒散，懶惰成性而不務正業。","他整日游手好閒，什麼事也不肯做，枉費了父母的苦心栽培。","飽食終日　無所事事","兀兀窮年　席不暇暖",[("辨析","「游手好閒」是形容人不務正業；而「好逸惡勞」側重於人喜歡安逸，不喜歡勞動。")])
add("愛屋及烏","ㄞˋ ㄨ ㄐㄧˊ ㄨ","比喻因愛一個人而連帶關心與他有關的人或物。","因為愛屋及烏，爺爺所留下的遺物，都被我們妥善地保存。")
add("滄海一粟","ㄘㄤ ㄏㄞˇ ㄧˊ ㄙㄨˋ","粟，小米。大海中的一粒小米。比喻非常渺小。","人與廣闊浩瀚的宇宙相比，不過是滄海一粟罷了。","秋毫之末　太倉一粟","龐然大物　碩大無朋",[("辨析","「滄海一粟」是比喻渺小，而「九牛一毛」是形容數目非常少，兩者意思稍有不同。")])
add("溫故知新","ㄨㄣ ㄍㄨˋ ㄓ ㄒㄧㄣ","指複習學過的知識，可以獲得新的理解和認識。","求學要時常溫故知新，才能有所成就。")
add("袖手旁觀","ㄒㄧㄡˋ ㄕㄡˇ ㄆㄤˊ ㄍㄨㄢ","形容人置身事外或不過問。","見到有人當街行搶，你為何袖手旁觀，不幫忙報警？","隔岸觀火　冷眼旁觀","見義勇為　拔刀相助")
add("相提並論","ㄒㄧㄤ ㄊㄧˊ ㄅㄧㄥˋ ㄌㄨㄣˋ","把性質、情況相似的人、事放在一起討論或看待。","這兩件事情毫不相干，如何能相提並論？","同日而語　混為一談")
