# -*- coding: utf-8 -*-
from e3 import E, add
for e in E:
    if e['name']=="相提並論": e['xf']="另眼相看"
add("戰戰兢兢","ㄓㄢˋ ㄓㄢˋ ㄐㄧㄥ ㄐㄧㄥ","形容做事時戒慎惶恐的態度。","面對即將來臨的大考，大家都戰戰兢兢，不敢有絲毫懈怠。","兢兢業業　如臨深淵","虛應故事　漫不經心",[("辨析","「戰戰兢兢」及「誠惶誠恐」都有恐懼戒慎的意思。前者側重於小心謹慎；「誠惶誠恐」更側重於內心的緊張不安。")])
add("墨守成規","ㄇㄛˋ ㄕㄡˇ ㄔㄥˊ ㄍㄨㄟ","形容思想守舊，只按老規矩辦事，不求改進。","企業家第二代若只是墨守成規，很難有所成就。","蹈常襲故　率由舊章","推陳出新　別出心裁")
add("調嘴弄舌","ㄊㄧㄠˊ ㄗㄨㄟˇ ㄋㄨㄥˋ ㄕㄜˊ","形容暗地裡說人長短，撥弄是非。","他總是調嘴弄舌，議論他人的是非，難怪沒有朋友。","挑撥離間　搖脣鼓舌","謹言慎行　隱惡揚善")
add("反璞歸真","ㄈㄢˇ ㄆㄨˊ ㄍㄨㄟ ㄓㄣ","比喻返回原有的本性。","他過了多年絢麗的生活，如今反璞歸真，從平淡中體會到人生的意義。","洗淨鉛華")
add("濠上之樂","ㄏㄠˊ ㄕㄤˋ ㄓ ㄌㄜˋ","形容閒適之情。","他自從退休以後，就過著有如濠上之樂的隱居生活。","閒鷗忘海　閒雲野鶴","籠鳥檻猿　池魚籠鳥")
add("懷才不遇","ㄏㄨㄞˊ ㄘㄞˊ ㄅㄨˋ ㄩˋ","指人懷有才學而不得施展。","這位作家才華洋溢卻始終沒沒無名，難怪會有懷才不遇之慨。","蛟龍失水　卞和泣璧","蛟龍得水　人盡其才")
add("趨炎附勢","ㄑㄩ ㄧㄢˊ ㄈㄨˋ ㄕˋ","形容人攀附權貴。","這個人只知趨炎附勢，從不憑真才實學去求取高位。","依草附木　攀龍附驥","守正不阿　頂天立地",[("俗諺","西瓜倚大邊（臺語）")])
add("毛遂自薦","ㄇㄠˊ ㄙㄨㄟˋ ㄗˋ ㄐㄧㄢˋ","比喻自我推薦。","她毛遂自薦，參加這場選美大賽。","自告奮勇　挺身而出","推三阻四　裹足不前",[("典故","戰國時代，秦國出兵圍攻趙國首都邯鄲。當時情況十分危急，於是趙王便派遣宰相平原君到楚國，請求派兵救趙。平原君奉命後準備挑選二十個文武雙全的屬下一同前往，但是經過幾番甄試後，只錄取了十九人。這時，有一位名為毛遂的人不經由別人推薦，自動請求同行。到了楚國後，毛遂口若懸河，以流利的口才辨析利害，終於說服了楚國，出兵解救趙國，為趙國立下大功。")])
add("鍥而不捨","ㄑㄧㄝˋ ㄦˊ ㄅㄨˋ ㄕㄜˇ","比喻做事持之以恆，堅持不懈。","只要有鍥而不捨的精神，相信夢想一定能達成。","持之以恆　孜孜不倦","一暴十寒　半途而廢")
BUTIE=("年齡篇",[("兒童篇","襁褓之年　始齔之年　總角之年"),("男子篇","束髮之年　志學之年　弱冠之年　而立之年　知命之年　春秋鼎盛"),("女子篇","荳蔻年華　及笄之年　二八年華"),("老年篇","耳順之年　花甲之年　古稀之年")])
